tests/modules/recurly_test_client/fixtures/invoices/show-200-past_due.xml

HTTP/1.1 200 OK
Content-Type: application/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<invoice href="https://api.recurly.com/v2/invoices/1001">
  <account href="https://api.recurly.com/v2/accounts/abcdef1234567890"/>
  <address>
    <address1>311 Crona Causeway</address1>
    <address2 nil="nil"></address2>
    <city>NAKNEK</city>
    <state>AK</state>
    <zip>99633</zip>
    <country>US</country>
    <phone nil="nil"></phone>
  </address>
  <subscription href="https://api.recurly.com/v2/subscriptions/30fb3db268a0ddbf62753a4cce8bfa7e"/>
  <uuid>30fb3db2766a00f1f6cc2043f59bd43a</uuid>
  <state>past_due</state>
  <invoice_number_prefix></invoice_number_prefix>
  <invoice_number type="integer">1001</invoice_number>
  <po_number nil="nil"></po_number>
  <vat_number nil="nil"></vat_number>
  <subtotal_in_cents type="integer">17263</subtotal_in_cents>
  <tax_in_cents type="integer">0</tax_in_cents>
  <total_in_cents type="integer">17263</total_in_cents>
  <currency>USD</currency>
  <created_at type="datetime">2015-09-02T05:05:55Z</created_at>
  <closed_at type="datetime">2015-09-02T05:05:55Z</closed_at>
  <terms_and_conditions>Some Terms and Conditions</terms_and_conditions>
  <customer_notes>Some Customer Notes</customer_notes>
  <net_terms type="integer">0</net_terms>
  <collection_method>automatic</collection_method>
  <line_items type="array">
    <adjustment href="https://api.recurly.com/v2/adjustments/30fb3db2727c2012eb62fd424ca6952f" type="charge">
      <account href="https://api.recurly.com/v2/accounts/abcdef1234567890"/>
      <invoice href="https://api.recurly.com/v2/invoices/1001"/>
      <subscription href="https://api.recurly.com/v2/subscriptions/30fb3db268a0ddbf62753a4cce8bfa7e"/>
      <uuid>30fb3db2727c2012eb62fd424ca6952f</uuid>
      <state>invoiced</state>
      <description>Setup fee: Et Quas2 Plan</description>
      <accounting_code nil="nil"></accounting_code>
      <product_code>et_quas2</product_code>
      <origin>setup_fee</origin>
      <unit_amount_in_cents type="integer">400</unit_amount_in_cents>
      <quantity type="integer">1</quantity>
      <discount_in_cents type="integer">0</discount_in_cents>
      <tax_in_cents type="integer">0</tax_in_cents>
      <total_in_cents type="integer">400</total_in_cents>
      <currency>USD</currency>
      <taxable type="boolean">false</taxable>
      <start_date type="datetime">2015-09-02T05:05:54Z</start_date>
      <end_date nil="nil"></end_date>
      <created_at type="datetime">2015-09-02T05:05:55Z</created_at>
    </adjustment>
  </line_items>
  <transactions type="array">
    <transaction href="https://api.recurly.com/v2/transactions/30fb3db27f36c18a54d35f4b63929c0f" type="credit_card">
      <account href="https://api.recurly.com/v2/accounts/abcdef1234567890"/>
      <invoice href="https://api.recurly.com/v2/invoices/1001"/>
      <subscription href="https://api.recurly.com/v2/subscriptions/30fb3db268a0ddbf62753a4cce8bfa7e"/>
      <uuid>30fb3db27f36c18a54d35f4b63929c0f</uuid>
      <action>purchase</action>
      <amount_in_cents type="integer">17263</amount_in_cents>
      <tax_in_cents type="integer">0</tax_in_cents>
      <currency>USD</currency>
      <status>success</status>
      <payment_method>credit_card</payment_method>
      <reference>5883860</reference>
      <source>subscription</source>
      <recurring type="boolean">false</recurring>
      <test type="boolean">true</test>
      <voidable type="boolean">false</voidable>
      <refundable type="boolean">true</refundable>
      <ip_address>45.185.92.138</ip_address>
      <cvv_result code="M">Match</cvv_result>
      <avs_result code="D">Street address and postal code match.</avs_result>
      <avs_result_street nil="nil"></avs_result_street>
      <avs_result_postal nil="nil"></avs_result_postal>
      <created_at type="datetime">2015-09-02T05:05:54Z</created_at>
      <details>
        <account>
          <account_code>abcdef1234567890</account_code>
          <first_name>Ursula</first_name>
          <last_name>Powlowski</last_name>
          <company>Predovic, Wilderman and Stehr</company>
          <email>3d0ef3cf33c6c390a991b@example.com</email>
          <billing_info type="credit_card">
            <first_name>Ursula</first_name>
            <last_name>Powlowski</last_name>
            <address1>311 Crona Causeway</address1>
            <address2 nil="nil"></address2>
            <city>NAKNEK</city>
            <state>AK</state>
            <zip>99633</zip>
            <country>US</country>
            <phone nil="nil"></phone>
            <vat_number nil="nil"></vat_number>
            <card_type>American Express</card_type>
            <year type="integer">2017</year>
            <month type="integer">9</month>
            <first_six>371449</first_six>
            <last_four>8431</last_four>
          </billing_info>
        </account>
      </details>
      <a name="refund" href="https://api.recurly.com/v2/transactions/30fb3db27f36c18a54d35f4b63929c0f" method="delete"/>
    </transaction>
  </transactions>
  <a name="refund" href="https://api.recurly.com/v2/invoices/1001/refund" method="post"/>
</invoice>
